{
  "url": "https://www.nomadicmatt.com/travel-blogs/sri-lanka-trip-planning-guide/",
  "title": "Sri Lanka Travel Guide (Updated 2025)",
  "author": "Matthew Kepnes",
  "publish_date": "2025-05-21T13:55:48-04:00",
  "text_snippet": "My visit to Sri Lanka — a jewel–shaped country in the Indian Ocean — was an unexpected surprise. I didn’t have a lot of expectations for the trip. But I loved every bit of Sri Lanka: the verdant landscape, the delicious food, the crumbling, overgrown ruins, the abundant wildlife, and (especially) the welcoming locals who took hospitality to the next level . Traveling Sri Lanka is relatively easy. It can be a little chaotic, with overcrowded buses moving along clogged roads where lanes are mere suggestions, and trains packed to the gills with people hanging off the edges (which actually is kind of fun). But English is widely spoken so once you get used to the chaos, it isn’t too difficult to get around. But there are a few things you should know before you visit Sri Lanka to avoid getting scammed, overspending, and, like me, missing some of the scenic trains! Here’s my guide to visiting Sri Lanka: Table of Contents Sri Lanka Travel Guide: 13 Things to Know for Your Visit Visiting Sri Lanka: How Much Does it Cost? What to See and Do in Sri Lanka: Itineraries By Region Where to Stay in Sri Lanka Sri Lanka Travel Guide: 13 Things to Know for Your Visit Before we get into some specifics on Sri Lanka, I want to share 14 must-know tips for the country! These tips will help ensure you have an awesome trip, stay safe, and don’t overspend! Travel Tip #1: Get your visa ahead of time – You’ll need to get a visa for entry into the country. You can do this either online starting three days before you arrive, or upon arrival. It’s slightly cheaper if you do it ahead of time, plus you’ll skip the lines at the border! Travel Tip #2: Don’t drink the water – You shouldn’t really drink the water in Sri Lanka, but as it’s really hot, you’ll want to keep hydrated. Bringing a reusable water bottle with a purifier will help you save money and avoid single-use plastic in the process. ( My preferred brand is Lifestraw. ) Travel Tip #3: Eat the local food – Outside of the major cities of Colombo and Kandy, you won’t find many non-Sri Lankan or non-Indian food options. What you do find is a poor excuse for Western food that is overpriced and often a chain. Stick to the local food! It’s super delicious anyway. Food, besides being crazy good, is also really cheap in Sri Lanka! Local food costs about 600-1,200 LKR for a meal of simple dishes like dosas (a kind of pancake), kottu (a dish made of roti (flatbread), vegetables, egg and/or meat, and spices), rice, chicken, and everything in between. At restaurants with table service, you’ll pay closer to 2,000-3,500 LKR. Travel Tip #4: Don’t expect to party – There aren’t too many chances to drink alcohol or get wild in Sri Lanka. Outside the coastal tourist towns and the capital of Colombo, there isn’t much nightlife or opportunities to drink. While you can always crack a beer at your guesthouse, Sri Lanka isn’t home to a big drinking/nightlife culture. Expect your nights to be tame. Travel Tip #5: Hire the Tuk-tuks – You can hire drivers cheaply. Any tuk-tuk driver will let you hire them for the day. Expect to pay around 10,000 LKR for the day. Moreover, tuk-tuk drivers are pretty honest, except in Colombo, where they will try to scam and overcharge you. Elsewhere in the country, you’ll get a fair deal. There’s no need to try to bargain hard. Travel Tip #6: Take the airport bus – You’ll most likely be flying in and/or out of Colombo. The blue Colombo Express Bus is the cheapest and easiest way to get from the airport to the city center. It’s around 500 LKR, leaves every 30 minutes (5:30am-8:30pm), and takes about an hour. In the city, buses stop at (and leave from) Central Bus Stand, Pettah Fort, and Colombo Fort Station. Alternatively, a taxi is 6,000–9,000 LKR. Travel Tip #7: Travel by train – Train travel, while often slower, is the cheapest (and best) way to get around. The landscapes are beautiful, and there’s something relaxing about sitting at the window watching the country pass you by. Traveling by train lets you connect with local culture in a way that flying between destinations just won’t do (plus, Sri Lanka is so small that taking an expensive short flight doesn’t make sense). Just adjust your expectations on timeliness and speed. Don’t be in a hurry when riding the rails in Sri Lanka! Travel Tip #8: Book your train in advance – If you are taking the scenic train from Kandy to Nuwara Eliya or Ella (or vice versa) and want a seat, book it in advance online. These tickets regularly sell out, especially in the high season. You can book starting 30 days in advance through the Sri Lankan railway’s website . Just remember to collect your physical tickets from the ticket office before departure. Alternatively, you can always get a cramped, unreserved second- or third-class ticket (where you’ll learn the new meaning of a tight squeeze) on the day of departure. That is never sold out. For more details on train travel in Sri Lanka, I recommend The Man in Seat 61’s guide . Travel Tip #9: Show up early at Sigiriya – If you are visiting Sigiriya (an ancient rock fortress and UNESCO World Heritage Site that’s probably the most famous landmark in the country), get there when it opens at 6:30am to avoid huge lines and crowds at the site. If you are there after 10am, the crowds are so overwhelming that it’s not worth visiting. It takes an hour to walk up as it’s single-file all the way! Travel Tip #10: Plan around the monsoons – Sri Lanka is affected by two different monsoons, so if you want the best weather during your trip, you’ll want to keep monsoon season in mind. If you want to visit the beaches in the south and west, go in December-March, while April-September is best for visiting the north and east. Travel Tip #11: Bring temple-appropriate clothing – Dress respectfully when visiting Sri Lanka’s sacred sites. That means wearing clothing that covers your shoulders and knees. You’ll also have to take your socks and shoes off before visiting temples (even if they are outdoors), so bring flip-flops to keep your socks clean! Travel Tip #12: Day trip to Galle – Galle is only worth a day trip. Don’t stay over in the town. There is not much to do there at all. There was so little to do there so I just went back to Colombo instead of staying the night. The same goes for many other towns, especially gateway towns to the national parks (more on that below). Travel Tip #13: Don’t rush your trip – Looking at the map of Sri Lanka, you might say, “Oh, it’s not that big. I bet I can cover a lot of ground in a short period of time.” You could, but you won’t “see” much. It will be too much of a blur. There is a lot to see and do in Sri Lanka and it takes a while to travel around. (For more on suggested itineraries, see below!) Visiting Sri Lanka: How Much Does it Cost? Sri Lanka is a cheap country to visit. Even when you splurge, it’s not that expensive. Overall, I would say you wouldn’t need more than a budget of 10,000-18,000 LKR per day. The country is very cheap, especially if you stick to delicious local or Indian cuisine (the food is so cheap there’s no reason to grocery shop and cook your own meals), avoid the overpriced Western style restaurants (local food tastes much better anyways), travel second- or third-class on trains and on buses, and don’t go crazy with the accommodation. Even though I was on a budget, I didn’t go as low as I could have (such as staying in dorms every night, eating only Sri Lankan food, doing minimal activities, etc.) and still found it was hard to break the bank. The expensive days in which I took a tour or decided to try some fancy restaurant were balanced out on the other days I didn’t. Here is a list of prices to help you get an idea of costs in Sri Lanka: Typical Museum and Attraction Costs: National Museum in Colombo – 1,500 LKR Half-day tour at Yala National Park – 16,900 LKR Temple of the Tooth in Kandy – 2,000 LKR Sigiriya Rock – 7,500 LKR Typical Food Costs: Bottle of water – 115 LKR Typical curry dish – 600–1,200 LKR Western dinner – 2,000+ LKR Domestic beer – 700 LKR Typical Transportation Costs: Airport taxi – 6,000+ LKR Train from Jaffna to Anuradhapura – 2,500 LKR Short tuk-tuk ride – 120–200 LKR What to See and Do in Sri Lanka: Itineraries By Region Where should you go in Sri Lanka? Most travelers focus on the southern half of the country, with its hiking and beach towns. After decades of war, the north has a legacy of destruction that has yet to go away. Anuradhapura and Sigiriya both have amazing ancient ruins. Kandy is filled with hiking treks, a big Buddhist temple, and a butterfly garden. Nuwara Eliya is known for its hiking, Tissa is the gateway to Yala National Park (which has elephants and leopards), and Galle is a beautiful old Dutch fort town. Though I originally had planned to explore only the south due to my limited time there, I was offered the opportunity to talk to a member of Parliament in Jaffna up north and learn about the Tamil war, so I rearranged my route to spend more time in the north. I was glad I did. Seeing the north gave me an added perspective on a portion of the country without hordes of other tourists. In fact, in my time up north, I saw only four Westerners. So…where should YOU go with so many places to explore? My Suggested Sri Lanka Itineraries I would break your Sri Lanka travels into two parts — the north/center and the south — and focus on one of those regions. There’s simply too much to do in the country and travel (buses and trains) around the country is too slow to try to cover so much ground in a limited time. (Unless you have more time, then the country is your oyster as the saying goes!) Southern Route (two weeks) : Colombo – Hikkaduwa – Galle – Mirissa – Tangalle – Tissa – Ella – Nuwara Eliya – Kandy – Colombo Northern Route (two weeks) : Colombo – Nuwara Eliya – Ella – Kandy – Sigiriya – Anuradhapura – Trincomalee – Jaffna – Colombo North and South (four weeks) : Colombo – Jaffna – Trincomalee – Anuradhapura – Sigi",
  "images": [
    "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20675%20395'%3E%3C/svg%3E",
    "https://media.nomadicmatt.com/srilankaguide1.jpg",
    "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20675%20395'%3E%3C/svg%3E",
    "https://media.nomadicmatt.com/2023/srilankaboathouse.jpg",
    "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20675%20395'%3E%3C/svg%3E",
    "https://media.nomadicmatt.com/2023/srilankalandscape.jpg",
    "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20675%20395'%3E%3C/svg%3E",
    "https://media.nomadicmatt.com/2023/srilankatrain.jpg",
    "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20675%20395'%3E%3C/svg%3E",
    "https://media.nomadicmatt.com/2023/gallesrilanka.jpg"
  ]
}