{
  "url": "https://snaphappytravel.com/top-things-to-do-in-sri-lanka-blog/",
  "title": "Our Honest Opinion of Sri Lanka (and the Best Things to Do)",
  "publish_date": "2018-08-03T04:13:51+13:00",
  "text_snippet": "Top things to do in Sri Lanka blog. Listing 12 of our favorite things to do in Sri Lanka! We spent three weeks in Sri Lanka recently en route to Europe. And, while we did like Sri Lanka, we didn’t love it. Let me explain why – there’s been some serious hype surrounding Sri Lanka, on Instagram, all you have to do is search #SriLanka and you’ll be inundated with images of yellow sand beaches, turquoise oceans, and colorful cities. Every travel influencer and their mother seems to have visited Sri Lanka of late, and so as a result, the world wide web is chock-a-block with articles waxing lyrical about Sri Lanka. The truth is, we believed the hype, were overly excited by it, and so expected too much from Sri Lanka and were left feeling a little underwhelmed. You know, when you build something up too much in your mind? Despite that there were several places in Sri Lanka that would have us returning again – and I’ve listed these, my top places to visit in Sri Lanka below. Would we visit Sri Lanka again? Views near Ella! Yes, we probably would, but we would do it a little differently. Maybe we could do two weeks in Sri Lanka next time and a week in the nearby island paradise of the Maldives. For us, Sri Lanka is one of those countries that you would really enjoy if you had money, and we were on a tight budget, considering we still had two months of travel ahead of us. Honestly, it was a lot more expensive than we expected. There are some gorgeous hotels on the island, but they are pricey; expect to pay up to about $100 USD a night for a nice hotel. Plus, we didn’t have much luck with Sri Lanka’s famous train journeys. So, if we were to return, we would be inclined to pay for private transfers the majority of the time. An exception to this rule is the Kandy to Ella journey, which truly is gorgeous. Anyway, despite our mixed view of Sri Lanka, I urge you to go and see it for yourself – it is beautifully colorful with epic beaches and friendly locals. And who knows, it may turn out to be one of your favorite places in the world. READ NEXT : If you love photography, like us, then you’ll find our unique guide to the most photogenic places in Sri Lanka very interesting! Now, without further ado, here are our top suggestions for things to do in Sri Lanka. The Best Things to Do in Sri Lanka 1. The famous train journey from Kandy to Ella The train from Kandy to Ella! Cost: Book reserved seats from $24 USD / 7,200 LKR (we highly recommend doing this) Departs from: Kandy Railway Station This trip didn’t go quite as we had planned. We booked a first-class ticket after our sweaty/packed-like-sardines experience on a second-class carriage from Colombo to Kandy a few days before. We showed up at the train station bright and early and took our comfy seats in the air-con carriage. When, 30 minutes after we were scheduled to depart, there was still no sign of movement, I got up to see what the delay was. Turns out the engine was broken. Queue lots of panicked workers running back and forth trying to fix it. Alas, after two hours, it was determined that it couldn’t be fixed, so we had to wait for an incoming train from Colombo to take its engine. We eventually departed about four hours late. About to watch the train from Kandy to Ella pass by! Oh well, the journey to Ella was as gorgeous as predicted, and we took lots of photos. However, be warned: one silly girl dropped her phone while hanging out the doorway to take photos, and we were told by a local that a couple of people had fallen out trying to take the perfect photo. They were unhurt, thankfully. 2. Relax on Rekawa beach Rekawa Beach is so pretty! Cost: Free! Location: Rekawa Beach on Google Maps here Instead of choosing the crowded beaches of Tangalle or Mirissa, we suggest spending your lazy days on Rekawa Beach. Particularly, the gorgeous Seven Turtles Resort – the beach here is pretty much deserted save for a few local fishermen, and through the months of October to April, you may be lucky enough to witness baby turtles hatch. There are so many gorgeous beaches in Sri Lanka that you could easily spend a month or more exploring them all. 3. Visit the Halpewatte tea factory in Ella My husband admires the view from the tea factory! Cost: Tours cost from LKR 3,000 ($10 USD) Location: Around 20-30 minutes from Ella This was unsurprisingly Paul’s favorite activity of the trip, being an Englishman, he LOVES his tea. It was fascinating to see tea processing up close at the Halpewette Tea Factory , a short distance from Ella. Plus, we got a behind-the-scenes look at the factory at work. We got to try all different types of teas, and the tasting room has epic views of the valley. We could have sat there all day sipping our tea (fruit tea only for me) and admiring the view. 4. See Sri Lankan elephants in the wild One of my favorite travel moments was seeing elephants on Safari in Udawalawe! Cost: A 3-hour safari tour costs from $27 USD per person Best months to visit: January to March Udawalawe National Park was my number one reason for visiting Sri Lanka. I’m beyond obsessed with elephants, and I’ve never seen one in the wild, that was until Udawalawe, where we saw not one but 30 elephants and even a teeny-tiny baby that was just one month old. Udawalawe is home to over 250 Sri Lankan elephants and is the third most visited national park in Sri Lanka, behind Yala National Park and Minneriya . A baby elephant in Udawalawe! Udawalawe absolutely lived up to its hype. Seeing these gorgeous animals in their natural habitat was one of the best moments of my life to date. The only way to see Udawalawe is on a guided tour. We did this 3 hour tour and really rated it. It’s 3 hours long and you can choose an early morning departure time (around 7 am) or an afternoon slot (around 3 pm) as those are the best times to see the elephants. It costs from $27 USD (8,161 LKR). 💡 BOOK the same Udawalawe tour we did here ! 5. Get lost in the cute & colorful streets of Galle Wandering around Galle! Cost: Free! Best sights to see in Galle: Galle Lighthouse, Fort Clock Tower, Dutch Hospital Galle is a fortified city built by the Portuguese, and many of its buildings show the influence of Portuguese architectural style on Sri Lankan traditions. It is certainly a unique place and so inherently different from other cities in Sri Lanka. Most of the best things to do in Galle can be found along the fort, which runs the length of the town on the coast – here, be sure to check out the famed Galle lighthouse, the Galle Fort Clock Tower, and Flag Point. Not too far from the Galle Lighthouse, you’ll find the Dutch Hospital, an old hospital that now houses some of the best restaurants and boutique stores in Galle. Galle is a UNESCO heritage site, and if you’re to add any city in Sri Lanka to your itinerary, it must be Galle. 6. Walk along the famous Nine Arches bridge in Ella Nine Arches Bridge is a must-visit while in Ella! Cost: Free! How to get there: It’s an hour’s walk from Ella or you can get a Tuk-Tuk for approx. 300 LKR ($1 USD) Surrounded by lush green jungle, the famed Nine Arches bridge in Ella is truly a sight for sore eyes and well worth the uneven, sometimes steep hike there. There was a swarm of deadly bees terrorising tourists on the tracks below so we didn’t quite make it all the way across the bridge for obvious reasons. Oh, and Paul got bitten by a leech. Anyway, we got some great photos but missed the train coming across the bridge which would have made for an incredible snap. 7. Spot some ‘photogenic’ local fishermen Fishermen on lovely Rekawa beach Cost: Free! Best places to see this: Koggala, Arugam Bay Sri Lanka is famed for its stilt fishermen (I’m sure you’ve seen the photos on Instagram/ Pinterest and the likes), unfortunately, we didn’t get to witness this on our trip, but we did see some guys catching fish in the middle of Udawalawe National Park and this epic example of teamwork on Rekawa beach (photo above). Anyways, supposedly the stilt fishermen is a scam ! One of the best places to witness this unique practice is in the town of Koggala, located near Galle. Here, locals balance on slender wooden stilts planted in the shallow waters, patiently waiting for their catch. 8. Photograph Galle’s gorgeous lighthouse Galle is so gorgeous! Cost: Free! Location: See here Not only is Galle famous for its gorgeous lighthouse, which is located on the southern end of the fort, but there are lots of things to keep you busy in Galle . Including golden sand beaches, shopping & excellent restaurants. But, the lighthouse is top of most people’s Galle itinerary and for good reason – it’s eye-catching! Did you know the original lighthouse was burned down in 1936 and had to be rebuilt?! 9. Relax and watch the sunset Sunset in Arugam Bay! Best sunset spots in Sri Lanka: Adam’s Peak, Arugam Bay, Galle Fort The coastal city of Negombo, not too far from the capital Colombo, is renowned for its epic beach sunsets. We spent every evening in Negombo watching the sunset from our hotel balcony. Bliss! To us, Negombo is the best spot to watch the sunset in Sri Lanka. The other best areas to watch the sunset in Sri Lanka: Adam’s Peak in the Central Highlands of Sri Lanka Arugam Bay on the east coast Sigiriya Rock – also known as Lion’s Rock Galle Fort in Galle 10. Tuk tuk tour of Colombo The Red Mosque in Colombo! My husband at the Dutch Hospital area! Cost: $59 USD per person Colombo, the biggest city in Sri Lanka (around 650,000 people live here) is likely where you’ll be starting your vacation to Sri Lanka, as that’s where the large International Airport is located. And for us, it wasn’t our favorite place in Sri Lanka – but, then we’re not really big city people. However, we did really enjoy the Tuk-Tuk tour we did of the city, which took us to the hidden gems of Colombo (spots like Sri Ponnambalam Vanesar Kovil temple). So, if you’re like us and love local spots and great food, then this Tuk It Easy Colombo tour ",
  "images": [
    "https://snaphappytravel.com/wp-content/uploads/2020/06/1707-2018-0509469587342831470.jpeg",
    "https://snaphappytravel.com/wp-content/uploads/2019/02/51668686_395785964314359_574305344440762368_n.jpg",
    "https://snaphappytravel.com/wp-content/uploads/2019/02/51743250_343625659571795_7759682220721176576_n-1.jpg",
    "https://snaphappytravel.com/wp-content/uploads/2020/04/LRM_EXPORT_20180727_095016-1024x768.jpg",
    "https://snaphappytravel.com/wp-content/uploads/2018/07/35616495_580176029049680_4983868170398859264_n.jpg",
    "https://snaphappytravel.com/wp-content/uploads/2018/07/31788361_229489514485272_6147626405774491648_n.jpg",
    "https://snaphappytravel.com/wp-content/uploads/2019/02/51692462_2637459619877201_746065377280131072_n-1024x683.jpg",
    "https://snaphappytravel.com/wp-content/uploads/2024/04/galle-sri-lanka-1024x683.jpeg",
    "https://snaphappytravel.com/wp-content/uploads/2019/02/51895264_618373825262202_7738879284629995520_n.jpg",
    "https://snaphappytravel.com/wp-content/uploads/2018/07/DSC03576-1024x768.jpg",
    "https://snaphappytravel.com/wp-content/uploads/2019/05/52384570_773687396330877_4468632550562070528_n.jpg",
    "https://snaphappytravel.com/wp-content/uploads/2018/07/arugam-bay-philipp-kammerer-1024x683.jpg",
    "https://snaphappytravel.com/wp-content/uploads/2024/10/temple-colombo-rotated.jpg",
    "https://snaphappytravel.com/wp-content/uploads/2019/02/IMG_3293-683x1024.jpg",
    "https://snaphappytravel.com/wp-content/uploads/2024/10/temple-of-the-tooth-1024x683.jpg",
    "https://snaphappytravel.com/wp-content/uploads/2018/07/sunrise-adams-peak-chamika-jayasri-1024x768.jpg",
    "https://snaphappytravel.com/wp-content/uploads/2024/10/rekawa-beach-1024x768.jpg",
    "https://snaphappytravel.com/wp-content/uploads/2024/08/IMG_3520-scaled-e1737556754269.jpg",
    "https://snaphappytravel.com/wp-content/uploads/2020/04/20200414_131859_0000-200x300.png"
  ]
}